{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "against Ukraine",
    "1": "against Western countries",
    "2": "aimed at other countries",
    "3": "general discourse",
    "4": "pro Russian government"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "against Ukraine": "0",
    "against Western countries": "1",
    "aimed at other countries": "2",
    "general discourse": "3",
    "pro Russian government": "4"
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 130,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tokenizer_class": "BertweetTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.53.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
