{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "appeal to authority",
    "1": "appeal to majority",
    "2": "appeal to nature",
    "3": "appeal to tradition",
    "4": "appeal to worse problems",
    "5": "false dilemma",
    "6": "hasty generalization",
    "7": "none",
    "8": "slippery slope"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "appeal to authority": "0",
    "appeal to majority": "1",
    "appeal to nature": "2",
    "appeal to tradition": "3",
    "appeal to worse problems": "4",
    "false dilemma": "5",
    "hasty generalization": "6",
    "none": "7",
    "slippery slope": "8"
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 130,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tokenizer_class": "BertweetTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.53.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
